/**
 * Created by wurui on 21/05/2017.
 */
define(function () {
    return [
        {"name": "阿尔法·罗密欧", "no": "20002"},
        {"name": "大众", "no": "20012"},
        {"name": "路虎", "no": "20031"},

        {
            "name": "标致",
            "no": "20009"
        },
        {"name": "丰田", "no": "20016"},
        {"name": "五菱", "no": "20183"},
        {"name": "别克", "no": "20138"},
        {
            "name": "奥迪",
            "no": "20004"
        },
        {
            "name": "沃尔沃",
            "no": "20001"
        },{"name": "雪佛兰", "no": "20047"},
        {"name": "哈弗", "no": "30009"},
        {"name": "奔驰", "no": "20007"},
        {"name": "保时捷", "no": "20006"},
        {"name": "福特", "no": "20017"}, {"name": "本田", "no": "20063"}, {"name": "宝马", "no": "20066"},
       {"name": "布加迪", "no": "20160"}, {"name": "比亚迪", "no": "10007"},{
            "name": "雷克萨斯",
            "no": "20026",
            "className":"whitebg"
        },
        {"name": "雪铁龙", "no": "10065"}, {"name": "现代", "no": "20046"}, {"name": "宝骏", "no": "20219"},
        {"name": "荣威", "no": "10089"}, {"name": "日产", "no": "20040"}, {"name": "马自达", "no": "20074"}, {
            "name": "MG",
            "no": "20142"
        },
        {"name": "菲亚特", "no": "20015"},{"name": "宾利", "no": "20010"},{"name": "传祺", "no": "20177"},
        {"name": "一汽", "no": "10060"},
        {
            "name": "铃木",
            "no": "20053"
        },
        {"name": "众泰", "no": "10077"}, {
            "name": "陆风",
            "no": "10039"
        },
        /*{
         "name": "北汽绅宝",
         "no": "30014"
         },{"name": "北汽新能源", "no": "30031"},

         */
        {"name": "奇瑞", "no": "10042"}, {
            "name": "起亚",
            "no": "10043"
        },
        {"name": "凯迪拉克", "no": "20021"},{
            "name": "北京",
            "no": "10004"
        },
        {"name": "smart", "no": "20020"}, {"name": "斯巴鲁", "no": "20044"}, {
            "name": "斯柯达",
            "no": "20045"
        }, {"name": "三菱", "no": "20056"},
        {
            "name": "北汽制造",
            "no": "20234"
        },

        {"name": "力帆", "no": "10076"}, {"name": "兰博基尼", "no": "20023"},
        {"name": "英菲尼迪", "no": "20050"},
        {"name": "东风", "no": "20111","className":"whitesolid"}, {"name": "东风启辰", "no": "20223"},{"name": "DS", "no": "20257"}, {"name": "雷诺", "no": "20027"}, {"name": "玛莎拉蒂", "no": "20033"},

        {"name": "北汽幻速", "no": "30025"}, {
            "name": "宝沃",
            "no": "30048"
        }, {"name": "比速汽车", "no": "30062"}, {"name": "Jeep", "no": "10030"}, {
            "name": "长安",
            "no": "10011"
        }, {"name": "长城", "no": "10012"}, {
            "name": "昌河",
            "no": "20161"
        }, {"name": "北汽威旺", "no": "20250"}, {"name": "金杯", "no": "20172"},
        {"name": "林肯", "no": "20029","className":"whitebg"},{"name": "特斯拉", "no": "20225"}, {"name": "腾势", "no": "20254"},
        {"name": "成功", "no": "30040"}, {"name": "东南", "no": "10018"}, {
            "name": "道奇",
            "no": "20013"
        }, {"name": "吉利", "no": "20148"},
        {"name": "中华", "no": "10070"},
        {"name": "福田", "no": "10005"}, {"name": "法拉利", "no": "20014"},  {
            "name": "福汽启腾",
            "no": "30023"
        },  {"name": "纳智捷", "no": "20240"}, {"name": "MINI", "no": "20036","className":"whitebg"},{"name": "欧宝", "no": "20037"}, {
            "name": "讴歌",
            "no": "20062"
        }, {"name": "福迪", "no": "30038"}, {"name": "GMC", "no": "20099"}, {
            "name": "观致",
            "no": "20266"
        }, {"name": "哈飞", "no": "10023"}, {"name": "红旗", "no": "10025"}, {"name": "华普", "no": "10026"}, {
            "name": "海马",
            "no": "10094"
        }, {"name": "悍马", "no": "20018"}, {"name": "华泰", "no": "20054"}, {"name": "黄海", "no": "20182"}, {
            "name": "恒天",
            "no": "20259"
        }, {"name": "劳斯莱斯", "no": "20025"}, {
            "name": "大通",
            "no": "20253"
        },
        {"name": "海格", "no": "30020"}, {"name": "华颂", "no": "30041"}, {
            "name": "华凯",
            "no": "30050"
        }, {"name": "汉腾汽车", "no": "30056"}, {"name": "华泰新能源", "no": "30057"}, {
            "name": "吉奥",
            "no": "10028"
        }, {"name": "江淮", "no": "10031"}, {"name": "江铃", "no": "10032"}, {
            "name": "捷豹",
            "no": "20035"
        }, {"name": "金龙", "no": "30027"}, {
            "name": "奔腾",
            "no": "20109","className":"whitesolid"
        },{
            "name": "九龙",
            "no": "30033"
        }, {"name": "克莱斯勒", "no": "10090"}, {"name": "开瑞", "no": "20149"}, {
            "name": "科尼赛克",
            "no": "20173"
        }, {"name": "凯翼", "no": "30037"}, {"name": "萨博", "no": "20041"}, {"name": "康迪", "no": "30047","className":"whitesolid"}, {
            "name": "猎豹",
            "no": "10037"
        }, {
            "name": "路特斯",
            "no": "20147"
        }, {"name": "劳伦士", "no": "20205"}, {"name": "理念", "no": "20224"},{
            "name": "飞驰商务车",
            "no": "30026"
        }, {
            "name": "莲花",
            "no": "20242"
        }, {"name": "雷丁", "no": "30043"}, {"name": "领克", "no": "30063"}, {
            "name": "迈巴赫",
            "no": "20034"
        },  {
            "name": "迈凯轮",
            "no": "20217","className":"whitebg"
        }, {"name": "摩根", "no": "20261"},
        {"name": "阿斯顿·马丁", "no": "20003"},
        {"name": "欧朗", "no": "20247"}, {"name": "帕加尼", "no": "20170"}, {"name": "瑞麒", "no": "20168"}, {"name": "双龙", "no": "20167"},
        {"name": "世爵", "no": "20169","className":"whitesolid"}, {
            "name": "Scion",
            "no": "20193"
        }, {"name": "思铭", "no": "20252"}, {
            "name": "威麟",
            "no": "20176"
        }, {"name": "五十铃", "no": "30032"}, {
            "name": "蔚来",
            "no": "30065","className":"whitesolid"
        },
        {"name": "Alpina", "no": "20192"}, {"name": "AC Schnitzer", "no": "20206"},{"name": "巴博斯", "no": "20264","className":"whitebg"},
        {
            "name": "西雅特",
            "no": "20175"
        }, {"name": "永源", "no": "10074"}, {
            "name": "野马",
            "no": "20216"
        }, {"name": "依维柯", "no": "30022"},  {
            "name": "双环",
            "no": "10053","className":"whitesolid"
        },{"name": "英致", "no": "30029"}, {
            "name": "中兴",
            "no": "10073"
        }, {"name": "中欧房车", "no": "20207"}, {"name": "光冈", "no": "20201","className":"whitesolid"}, {"name": "之诺", "no": "30021"}, {
            "name": "知豆",
            "no": "30030"
        }
    ]
})